{
  "project": "eternity-loop",
  "branchName": "mikael/hug-13-every-user-has-its-own-database",
  "description": "Migrate from a single shared SQLite database to per-user SQLite database files. Auth tables (User, OtpCode, Session) remain in a central database, while user data (Project, TimeEntry) moves to individual SQLite files per user. This provides complete data isolation between users.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Split Prisma schema and configure DB folder",
      "description": "As a developer, I want the Prisma schema split into a central auth schema (User, OtpCode, Session) and a per-user data schema (Project, TimeEntry) so that each concern uses its own database.",
      "acceptanceCriteria": [
        "A central Prisma schema exists containing User, OtpCode, and Session models",
        "A per-user Prisma schema exists containing Project and TimeEntry models without User foreign keys",
        "The per-user schema uses a placeholder datasource URL that will be overridden at runtime",
        "DATABASE_URL in .env.example is replaced with DATABASE_DIR pointing to a folder path (e.g., ./data) and AUTH_DATABASE_URL pointing to the central auth DB file",
        "Both schemas can generate their own Prisma clients without conflicts"
      ],
      "priority": 1,
      "passes": true
    },
    {
      "id": "US-002",
      "title": "Implement per-user DB client factory",
      "description": "As a developer, I want a factory that dynamically creates and caches PrismaClient instances for each user's SQLite file so that services can access user-specific databases.",
      "acceptanceCriteria": [
        "A getUserDb(userId) function returns a PrismaClient connected to the user's SQLite file at DATABASE_DIR/<userId>.db",
        "PrismaClient instances are cached so repeated calls for the same user reuse the connection",
        "The central auth DB client remains a singleton as before",
        "A createUserDatabase(userId) function initializes a new SQLite file with the per-user schema when called"
      ],
      "priority": 2,
      "passes": true
    },
    {
      "id": "US-003",
      "title": "Create per-user DB on user registration",
      "description": "As a user logging in for the first time, I want my own SQLite database file to be automatically created so that my data is stored in isolation.",
      "acceptanceCriteria": [
        "When verifyOtp creates a new user in the central DB, it also creates the user's SQLite file and pushes the per-user schema",
        "The DATABASE_DIR folder is created automatically if it does not exist",
        "Existing users who already have a DB file are not affected on subsequent logins",
        "If DB file creation fails, the user creation in the central DB is rolled back"
      ],
      "priority": 3,
      "passes": true
    },
    {
      "id": "US-004",
      "title": "Update auth middleware to provide per-user DB",
      "description": "As a developer, I want the auth middleware to attach the per-user PrismaClient to the request context so that downstream route handlers and services can use it.",
      "acceptanceCriteria": [
        "The auth middleware resolves the authenticated user's DB client via getUserDb(userId)",
        "The per-user DB client is available on the Hono context (e.g., c.set('userDb', client))",
        "Route handlers pass the per-user DB client to service functions",
        "Unauthenticated routes (OTP request, OTP verify, refresh) continue using only the central auth DB"
      ],
      "priority": 4,
      "passes": true
    },
    {
      "id": "US-005",
      "title": "Update data services to use per-user DB",
      "description": "As a user, I want my projects, time entries, and reports to be read from and written to my own database so that my data is fully isolated.",
      "acceptanceCriteria": [
        "project.service.ts uses the per-user DB client instead of the shared db singleton",
        "time-entry.service.ts uses the per-user DB client instead of the shared db singleton",
        "report.service.ts uses the per-user DB client instead of the shared db singleton",
        "All service functions accept the per-user DB client as a parameter",
        "The userId filter on queries is no longer needed since the database itself is user-scoped, but keeping it does no harm",
        "All existing API endpoints continue to work correctly"
      ],
      "priority": 5,
      "passes": false
    },
    {
      "id": "US-006",
      "title": "Update Docker and deployment configuration",
      "description": "As a developer deploying the app, I want the Docker setup to support the per-user database folder so that the application works correctly in containerized environments.",
      "acceptanceCriteria": [
        "Dockerfile.api is updated to create the DATABASE_DIR folder",
        ".env.example documents the new DATABASE_DIR and AUTH_DATABASE_URL variables",
        "The data folder is configured as a Docker volume for persistence",
        "The Prisma generate and db push commands work for both schemas in the Docker build",
        "The application starts successfully in Docker with the new configuration"
      ],
      "priority": 6,
      "passes": false
    }
  ]
}
